In [32]:
import pandas as pd

<h1>lets learn about merge dataframes</h1>

In [54]:
#dummy dataframes
#in spring 
df1=pd.DataFrame({
    'city':['new york','chicago','boston'],
    'temperature':[25,23,21]
    
})
df2=pd.DataFrame({
    'city':['new york','chicago','boston'],
    'temperature':[25,27,27]
    
})
df1

       city  temperature
0  new york           25
1   chicago           23
2    boston           21

In [55]:
df2

       city  temperature
0  new york           25
1   chicago           27
2    boston           27

'on' is the compared value and since temperature are different but city is same it is seprated by different name for temperature

In [56]:
df=pd.merge(df1,df2,on='city')
df

       city  temperature_x  temperature_y
0  new york             25             25
1   chicago             23             27
2    boston             21             27

In [57]:
df=pd.merge(df1,df2,how='inner')
df 
#it shows the same elements within df1 and df2

       city  temperature
0  new york           25

In [58]:
df=pd.merge(df1,df2,how='outer')
df #it only shows elements which are not common on df1 and df2

       city  temperature
0  new york           25
1   chicago           23
2    boston           21
3   chicago           27
4    boston           27

In [59]:
df=pd.merge(df1,df2,how='left')
df #it only shows elements which are  on df1 only

       city  temperature
0  new york           25
1   chicago           23
2    boston           21

In [60]:
df=pd.merge(df1,df2,how='right')
df #it only shows elements which are  on df2 only

       city  temperature
0  new york           25
1   chicago           27
2    boston           27

<h3>Pivot tables</h3>

In [64]:
#dummy data
df=pd.date_range(start='2015-02-17',end='2015-02-20')
df

DatetimeIndex(['2015-02-17', '2015-02-18', '2015-02-19', '2015-02-20'], dtype='datetime64[ns]', freq='D')

In [76]:
df=pd.DataFrame({
    'date':['2015-02-17', '2015-02-18', '2015-02-19', '2015-02-20'], 
    'city':['nyc','nyc','nyc','nyc'],
    'temp':[26,27,28,29],
    'humidity':[36,34,33,38]
})
df

         date city  temp  humidity
0  2015-02-17  nyc    26        36
1  2015-02-18  nyc    27        34
2  2015-02-19  nyc    28        33
3  2015-02-20  nyc    29        38

In [77]:
#to get a better way for learning datatable
df.pivot(index='date',columns='city')

           temp humidity
city        nyc      nyc
date
2015-02-17   26       36
2015-02-18   27       34
2015-02-19   28       33
2015-02-20   29       38

In [78]:
df.pivot(index='date',columns='city',values='temp')

city        nyc
date
2015-02-17   26
2015-02-18   27
2015-02-19   28
2015-02-20   29

In [79]:
df.pivot(index='date',columns='city',values='humidity')

city        nyc
date
2015-02-17   36
2015-02-18   34
2015-02-19   33
2015-02-20   38

<h3>we can choose to show temp or humidity using values </h3>